# Один и тот же товар может лежать на складе в Москве, в Казани или в обоих городах. Ниже id товаров на каждом складе.
# 
# ```python
# moscow = {201, 202, 203, 204}
# kazan = {203, 204, 205, 206}
# ```
# 
# Нужно найти:
# 
# - что можно забрать в любом из двух городов
# - что есть только в Москве
# - что есть только в Казани
# - сколько разных товаров на обоих складах вместе

moscow = {201, 202, 203, 204}
kazan = {203, 204, 205, 206}

both = moscow & kazan
only_moscow = moscow - kazan
only_kazan = kazan - moscow
all = moscow | kazan

print(f'можно забрать в любом из двух городов {sorted(both)}')
print(f'есть только в Москве {sorted(only_moscow)}')
print(f'есть только в Казани {sorted(only_kazan)}')
print(f'всего разных товаров {len(all)}')
